// *++
//
// Copyright (c) 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   RmStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell Rm command
// 
// Revision History:
// 
// --*/
 
/=#

#langdef   eng "English"

#string STR_RM_ARG_ZERO_LENGTH         #language eng  "%Hrm/del%N: Argument with zero length is not allowed\n"

#string STR_RM_CANNOT_FIND             #language eng  "%Hrm/del%N: Cannot find %hs - %r\n"

#string STR_RM_CANNOT_REMOVE_ROOT_DIR  #language eng  "%Hrm/del%N: Cannot remove root directory\n"

#string STR_RM_CANNOT_GET_CURRENT_DIR  #language eng  "%Hrm/del%N: Cannot get current directory\n"

#string STR_RM_CANNOT_REMOVE_CURRENT_DIR #language eng  "%Hrm/del%N: Cannot remove current directory or its ancestor\n"

#string STR_RM_ERROR                   #language eng  "- [error] - %r\n"

#string STR_RM_OK                      #language eng  " - [ok]\n"

#string STR_RM_CANCELED                #language eng  "- Canceled by user\n"

#string STR_RM_OUT_OF_RESOURCES        #language eng  "%Hrm/del%N: Out of resources\n"

#string STR_RM_CANNOT_ACCESS           #language eng  "%Hrm/del%N: Cannot access %hs\n"

#string STR_RM_CANNOT_OPEN_UNDER       #language eng  "%Hrm/del%N: Cannot open %hs under %hs in write mode \n"

#string STR_RM_REMOVE_SUBTREE          #language eng  "%Hrm/del%N: Remove subtree %hs [y/n]? "

#string STR_RM_OUT_OF_MEM              #language eng  "%Hrm/del%N: Out of memory\n"

#string STR_RM_PATH_TOO_LARGE          #language eng  "%Hrm/del%N: Path of %hs is too long\n"

#string STR_RM_REMOVING                #language eng  "removing %hs\n"

#string STR_RM_LINE_HELP                #language eng  "Deletes one or more files or directories"

#string STR_RM_VERBOSE_HELP            #language eng  "Deletes one or more files or directories.\n"
                                                      "\n"
                                                      "RM [-q] file/directory [file/directory ...]\n"
                                                      "\n"
                                                      "    -q           - Quiet mode, doesn't prompt user for a confirmation\n"
                                                      "    file         - File name (wildcards are permitted)\n"
                                                      "    directory    - Directory name (wildcards are permitted)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. To remove a read-only file/directory will result failure, to remove a\n"
                                                      "       directory containing read-only file(s) will result failure.\n"
                                                      "    2. If error occurs, RM will exit immediately and later files/directories\n"
                                                      "       will not be removed.\n"
                                                      "    3. Can not remove a directory when the current directory is itself or its\n"
                                                      "       subdirectory.\n"
                                                      "    4. If file contains wildcards, it won't ask user for confirmation.\n"
                                                      "    5. You cannot remove the root directory.\n"
                                                      "    6. You cannot remove the current directory or its ancestor.\n"
                                                      "    7. Redirecting output to a file that exists under the directory \n"
                                                      "       that will be removed is not allowed.\n"

                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To remove multiple directories at a time:\n"
                                                      "    fs0:\\> ls test\n"
                                                      "    Directory of: fs0:\\test\n"
                                                      "\n"
                                                      "      06/18/01  01:01p <DIR>            512  .\n"
                                                      "      06/18/01  01:01p <DIR>              0  ..\n"
                                                      "      06/19/01  12:59a <DIR>            512  temp1\n"
                                                      "      06/19/01  12:59a <DIR>            512  temp2\n"
                                                      "              0 File(s)           0 bytes\n"
                                                      "              4 Dir(s)\n"
                                                      "\n"
                                                      "  * Error occurs and RM will exit:\n"
                                                      "    fs0:\\> rm test\\temp11 temp2\n"
                                                      "    rm/del: Cannot find 'fs0:\\test\\temp11' - Not Found\n"
                                                      "\n"
                                                      "  * To remove multiple directories with wildcards:\n"
                                                      "    fs0:\\> rm test\\temp*\n"
                                                      "    rm/del: Remove subtree 'fs0:\\test\\temp1' [y/n]? y\n"
                                                      "    removing fs0:\\test\\temp1\\temp1.txt\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\\boot\\nshell.efi\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\\boot\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\n"
                                                      "     - [ok]\n"
                                                      "    rm/del: Remove subtree 'fs0:\\test\\temp2' [y/n]? y\n"
                                                      "    removing fs0:\\test\\temp2\\temp2.txt\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp2\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * To remove a directory that contains a read-only file will fail:\n"
                                                      "    fs0:\\> attrib +r test\\temp1\\readme.txt\n"
                                                      "     A  R fs0:\\test\\temp1\\readme.txt\n"
                                                      "\n"     
                                                      "    fs0:\\> rm test\\temp1\n"
                                                      "    rm/del: Cannot open readme.txt under fs0:\\test\\temp1 in write mode\n"
                                                      "    - [error] - Access Denied\n"
                                                      "    Exit status code: Access Denied\n"                                                  

#string STR_DEL_LINE_HELP              #language eng  "Deletes one or more files or directories"

#string STR_DEL_VERBOSE_HELP           #language eng  "Deletes one or more files or directories.\n"
                                                      "\n"
                                                      "DEL [-q] file/directory [file/directory ...]\n"
                                                      "\n"
                                                      "    -q           - Quiet mode; does not prompt user for a confirmation\n"
                                                      "    file         - File name (wildcards are permitted)\n"
                                                      "    directory    - Directory name (wildcards are permitted)\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. Removing a read-only file/directory will result in a failure.\n"
                                                      "       Removing a directory containing read-only file(s) will result\n"
                                                      "       in a failure.\n"
                                                      "    2. If an error occurs, DEL will exit immediately and later files/directories\n"
                                                      "       will not be removed.\n"
                                                      "    3. You cannot remove a directory when the current directory is itself or its\n"
                                                      "       subdirectory.\n"
                                                      "    4. If file contains wildcards, it will not ask user for confirmation.\n"
                                                      "    5. You cannot remove the root directory.\n"
                                                      "    6. You cannot remove the current directory or its ancestor.\n"
                                                      "    7. Redirecting output to a file that exists under the directory \n"
                                                      "       that will be removed is not allowed.\n"

                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To remove multiple directories at a time:\n"
                                                      "    fs0:\\> ls test\n"
                                                      "    Directory of: fs0:\\test\n"
                                                      "\n"
                                                      "      06/18/01  01:01p <DIR>            512  .\n"
                                                      "      06/18/01  01:01p <DIR>              0  ..\n"
                                                      "      06/19/01  12:59a <DIR>            512  temp1\n"
                                                      "      06/19/01  12:59a <DIR>            512  temp2\n"
                                                      "              0 File(s)           0 bytes\n"
                                                      "              4 Dir(s)\n"
                                                      "\n"
                                                      "  * Error occurs and DEL will exit:\n"
                                                      "    fs0:\\> del test\\temp11 temp2\n"
                                                      "    rm/del: Cannot find 'fs0:\\test\\temp11' - Not Found\n"
                                                      "\n"
                                                      "  * To remove multiple directories with wildcards:\n"
                                                      "    fs0:\\> del test\\temp*\n"
                                                      "    rm/del: Remove subtree 'fs0:\\test\\temp1' [y/n]? y\n"
                                                      "    removing fs0:\\test\\temp1\\temp1.txt\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\\boot\\nshell.efi\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\\boot\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp1\n"
                                                      "     - [ok]\n"
                                                      "    rm/del: Remove subtree 'fs0:\\test\\temp2' [y/n]? y\n"
                                                      "    removing fs0:\\test\\temp2\\temp2.txt\n"
                                                      "     - [ok]\n"
                                                      "    removing fs0:\\test\\temp2\n"
                                                      "     - [ok]\n"
                                                      "\n"
                                                      "  * Removing directory that contains a read-only file will fail:\n"
                                                      "    fs0:\\> attrib +r test\\temp1\\readme.txt\n"
                                                      "     A  R fs0:\\test\\temp1\\readme.txt\n"
                                                      "\n"     
                                                      "    fs0:\\> del test\\temp1\n"
                                                      "    rm/del: Cannot open 'readme.txt' under 'fs0:\\test\\temp1' in write mode\n"
                                                      "    - [error] - Access Denied\n"
                                                      "    Exit status code: Access Denied\n"



